---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.Insert(Autodesk.Revit.DB.SymbolicCurve,System.Int32)
source: html/2bfa7d2d-7455-bfa6-0a63-64713ff0003a.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.Insert Method

Insert the specified model curve into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	SymbolicCurve item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.SymbolicCurve`) - The model curve to be inserted into the array.
- **index** (`System.Int32`) - The model curve will be inserted before this index.

## Returns
Returns whether the model curve was inserted into the array.